lisir233/ESP-Iris/components/esp_iris/examples/tcp_pairing/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

CONFIG_ESP_IRIS_TRANSPORT_TCP=y
CONFIG_ESP_IRIS_TCP_PAIRING=y
CONFIG_ESP_IRIS_TCP_PORT=19772
CONFIG_ESP_IRIS_AUTH_FAILURE_DELAY_MS=500

# Credentials and the initial pairing token deliberately have empty defaults.
CONFIG_ESP_IRIS_EXAMPLE_WIFI_SSID=""
CONFIG_ESP_IRIS_EXAMPLE_WIFI_PASSWORD=""
CONFIG_ESP_IRIS_EXAMPLE_PAIRING_TOKEN=""

CONFIG_ESP_IRIS_FIRMWARE_ROLE=1
